In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
%matplotlib inline

In [2]:
df =pd.read_csv('online_store_customer_data.csv')

In [3]:
df.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN

In [4]:
df.shape

(2512, 11)

In [44]:
df.columns.values

array(['Transaction_date', 'Transaction_ID', 'Gender', 'Age',
       'Marital_status', 'State_names', 'Segment', 'Employees_status',
       'Payment_method', 'Referal', 'Amount_spent'], dtype=object)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2512 non-null   object
 1   Transaction_ID    2512 non-null   int64
 2   Gender            2484 non-null   object
 3   Age               2470 non-null   float64
 4   Marital_status    2512 non-null   object
 5   State_names       2512 non-null   object
 6   Segment           2512 non-null   object
 7   Employees_status  2486 non-null   object
 8   Payment_method    2512 non-null   object
 9   Referal           2357 non-null   float64
 10  Amount_spent      2270 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 216.0+ KB

In [46]:
df.describe()

       Transaction_ID          Age      Referal  Amount_spent
count     2512.000000  2470.000000  2357.000000   2270.000000
mean    152443.931131    46.637652     0.652100   1418.422577
std        724.580482    18.186277     0.476405    878.507451
min     151200.000000    15.000000     0.000000      2.090000
25%     151815.750000    32.000000     0.000000    678.192500
50%     152443.500000    47.000000     1.000000   1341.435000
75%     153071.250000    62.000000     1.000000   2038.102500
max     153699.000000    78.000000     1.000000   2999.980000

In [11]:
df.select_dtypes(include='object').columns

Index(['Transaction_date', 'Gender', 'Marital_status', 'State_names',
       'Segment', 'Employees_status', 'Payment_method'],
      dtype='object')

In [26]:
len(df.select_dtypes(include ='object').columns)

7

In [27]:
len(df.select_dtypes(include ='float64').columns)

3

In [29]:
len(df.select_dtypes(include ='int64').columns)

1

In [31]:
df.isnull().values.any()

True

In [48]:
df.isnull().sum()

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [33]:
df.size

27632

In [12]:
#dropping null values
df.dropna(inplace =True)

In [50]:
df.shape

(2044, 11)

In [52]:
df.isnull().values.any()

False

In [53]:
df.isnull().sum()

Transaction_date    0
Transaction_ID      0
Gender              0
Age                 0
Marital_status      0
State_names         0
Segment             0
Employees_status    0
Payment_method      0
Referal             0
Amount_spent        0
dtype: int64

In [54]:
df.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
5,1/3/2019,151205,Male,71.0,Single,Hawaii,Basic,Employees,PayPal,1.0,2922.66
6,1/3/2019,151206,Female,34.0,Married,New Mexico,Platinum,Employees,PayPal,1.0,1481.42

In [13]:
#checking the duplicated values
df.duplicated().value_counts()

False    2034
True       10
dtype: int64

In [14]:
#dropping the duplicates
df.drop_duplicates(inplace=True)

In [58]:
df.duplicated().value_counts()

False    2034
dtype: int64

In [59]:
df.shape

(2034, 11)

In [60]:
#determing the datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2034 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2034 non-null   object
 1   Transaction_ID    2034 non-null   int64
 2   Gender            2034 non-null   object
 3   Age               2034 non-null   float64
 4   Marital_status    2034 non-null   object
 5   State_names       2034 non-null   object
 6   Segment           2034 non-null   object
 7   Employees_status  2034 non-null   object
 8   Payment_method    2034 non-null   object
 9   Referal           2034 non-null   float64
 10  Amount_spent      2034 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 190.7+ KB

In [61]:
df.dtypes

Transaction_date     object
Transaction_ID        int64
Gender               object
Age                 float64
Marital_status       object
State_names          object
Segment              object
Employees_status     object
Payment_method       object
Referal             float64
Amount_spent        float64
dtype: object

In [15]:
#changing the datatype of date from object to datetime
df['Transaction_date']=df['Transaction_date'].apply(pd.to_datetime)

In [16]:
df.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,2019-01-01,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,2019-01-01,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,2019-01-01,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
5,2019-01-03,151205,Male,71.0,Single,Hawaii,Basic,Employees,PayPal,1.0,2922.66
6,2019-01-03,151206,Female,34.0,Married,New Mexico,Platinum,Employees,PayPal,1.0,1481.42

In [67]:
df.dtypes

Transaction_date    datetime64[ns]
Transaction_ID               int64
Gender                      object
Age                        float64
Marital_status              object
State_names                 object
Segment                     object
Employees_status            object
Payment_method              object
Referal                    float64
Amount_spent               float64
dtype: object

In [17]:
#changing the datatype of [referal and age] from float to integer
df['Age'] =df['Age'].astype(int)
df['Referal']=df['Referal'].astype(int)

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2034 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2034 non-null   datetime64[ns]
 1   Transaction_ID    2034 non-null   int64
 2   Gender            2034 non-null   object
 3   Age               2034 non-null   int32
 4   Marital_status    2034 non-null   object
 5   State_names       2034 non-null   object
 6   Segment           2034 non-null   object
 7   Employees_status  2034 non-null   object
 8   Payment_method    2034 non-null   object
 9   Referal           2034 non-null   int32
 10  Amount_spent      2034 non-null   float64
dtypes: datetime64[ns](1), float64(1), int32(2), int64(1), object(6)
memory usage: 174.8+ KB

In [76]:
df.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,2019-01-01,151200,Female,19,Single,Kansas,Basic,Unemployment,Other,1,2051.36
1,2019-01-01,151201,Male,49,Single,Illinois,Basic,self-employed,Card,0,544.04
2,2019-01-01,151202,Male,63,Married,New Mexico,Basic,workers,PayPal,1,1572.60
5,2019-01-03,151205,Male,71,Single,Hawaii,Basic,Employees,PayPal,1,2922.66
6,2019-01-03,151206,Female,34,Married,New Mexico,Platinum,Employees,PayPal,1,1481.42

In [ ]:
#statistical summary of age and amount spent

In [18]:
df.drop(columns=['Transaction_ID', 'Referal']).describe()

               Age  Amount_spent
count  2034.000000   2034.000000
mean     46.897247   1430.370492
std      18.218701    884.733030
min      15.000000      2.090000
25%      32.000000    678.192500
50%      47.000000   1358.310000
75%      62.000000   2056.622500
max      78.000000   2999.980000

In [19]:
#checking the unique values in each column
df.nunique()

Transaction_date     787
Transaction_ID      2034
Gender                 2
Age                   63
Marital_status         2
State_names           50
Segment                5
Employees_status       4
Payment_method         3
Referal                2
Amount_spent        2028
dtype: int64

In [20]:
#correcting the index
df.reset_index(inplace=True)

In [83]:
df.head()

,index,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,0,2019-01-01,151200,Female,19,Single,Kansas,Basic,Unemployment,Other,1,2051.36
1,1,2019-01-01,151201,Male,49,Single,Illinois,Basic,self-employed,Card,0,544.04
2,2,2019-01-01,151202,Male,63,Married,New Mexico,Basic,workers,PayPal,1,1572.60
3,5,2019-01-03,151205,Male,71,Single,Hawaii,Basic,Employees,PayPal,1,2922.66
4,6,2019-01-03,151206,Female,34,Married,New Mexico,Platinum,Employees,PayPal,1,1481.42

In [ ]:
#drop the columns 'index' and 'Transaction_ID'
df.drop(columns=['index', 'Transaction_ID'], inplace=True)

In [22]:
df.head()

,Transaction_date,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,2019-01-01,Female,19,Single,Kansas,Basic,Unemployment,Other,1,2051.36
1,2019-01-01,Male,49,Single,Illinois,Basic,self-employed,Card,0,544.04
2,2019-01-01,Male,63,Married,New Mexico,Basic,workers,PayPal,1,1572.60
3,2019-01-03,Male,71,Single,Hawaii,Basic,Employees,PayPal,1,2922.66
4,2019-01-03,Female,34,Married,New Mexico,Platinum,Employees,PayPal,1,1481.42

# Data visualisation

In [ ]:
# Univariate analysis for data analysis
plt.figure(figsize=(10,6))
sns.histplot(data=df, x ='Transaction_date', color ='r', bins =30)
plt.title('Distribution of Transactions by Date')
plt.xlabel('Transaction Date')
plt.ylabel('Frequency')